<?php

// Задача 2:
// Ще наричаме площадка непрекъсната последователност от елементи с
// равни стойности.
// Да се състави програма, която проверява коя е най-дългата площадка
// в предварително въведен масив от естествени числа.
// Програмата да извежда началния вид на масива и най-дългата
// площадка в него.
// Пример:
// 1 3 3 7 9 9 9 9 11 11 12 14
// Изход:
// Най-дългата площадка е: 4 елемента
// Брой на площадките: 3

$array = array(1, 3, 3, 7, 9, 9, 9, 9, 11, 11, 12, 14);

$cnt = 1;
$maxCnt = 0;
$pl = false;
$plCnt = 0;

for ($i = 0; $i < count($array) - 1; $i++) {
	
	for ($j = 1; $j < count($array) - $i - 1; $j++) {
		if ($array[$i] == $array[$j + $i]) {
			$cnt++;
			$pl = true;
		} else {
			break;
		}
	}
	
	$maxCnt = max($cnt, $maxCnt);
	$cnt = 1;
	if ($pl){
		$plCnt++;
		$i += $j - 1;
	}
	$pl = false;
}

echo 'Най-дългата площадка е: ', $maxCnt, ' елемента', PHP_EOL;
echo 'Брой на площадките: ', $plCnt;