<?php

// Задача 3:
// Да се състави програма, която проверява дали: предварително
// въведен масив от естествени числа е сортиран във възходящ ред.
// Програмата да извежда съобщения и в двата случая.
// Пример:
// 1 3 5 7 9 11 10
// Изход:
// 11 > 10
// Елементите на масива не са сортирани.

$array = [1, 3, 5, 7, 9, 11, 10];
$result = 'Елементите на масива са сортирани.';

for ($i = 0; $i < count($array) - 1; $i++) {
	if ($array[$i] > $array[$i + 1]) {
		echo $array[$i] . ' > ' . $array[$i + 1] . PHP_EOL;
		$result = 'Елементите на масива не са сортирани.';
		break;
	} 
}

echo $result;