<?php

// Задача 9: Да се прочетат 2 числа от клавиатурата А и В.
// Да се изведат всички числа от А до В на степен 2(разделени с
// запетая).Ако някое число е кратно на 3, да се изведе съобщение че
// числото се пропуска „skip 3“.Ако сумата от всички изведени числа (без
// пропуснатите) стане по-голяма от 200, да се прекрати извеждането.

require_once 'readline.php';

$a = readline('Въведете първото число A: ', PHP_EOL);
$b = readline('Въведете второто число B: ', PHP_EOL);

$min = min($a, $b);
$max = max($a, $b);
$sum = 0;

while (($min <= $max) && ($sum <= 200)) {
	if ($min % 3 != 0) {
		echo pow($min, 2);
		$sum += pow($min, 2);
	}
	else {
		echo "skip $min";
	}
	$min++;
	if (($min <= $max) && ($sum <= 200)){
		echo ', ';
	}
	
}