<?php

// Задача 19: Да се състави програма, чрез която по въведено
// естествено число от интервала [10..99] се извежда поредица
// числа, при спазване на следните изисквания:
// 1) ако предходното число е четно се извежда 0.5*числото;
// 2) ако предходното число е нечетно се извежда 3*числото +1.
// Извеждането продължава докато не се получи стойност 1.
// Пример: 11
// Изход: 34 17 52 26 13 40 20 10 5 16 8 4 2 1.

require_once 'readline.php';

do{
	$n = readline('Въведете естествено число[10..99]: ', PHP_EOL);
} while ($n < 10 || $n > 99);

do {
	if ($n % 2 == 0) {
		$n *= 0.5;
		echo "$n ";
	}
	else {
		$n = $n * 3 + 1;
		echo "$n ";
	}
} while ($n > 1);
