<?php

// Задача 18:
// Да се състави програма, чрез която се въвежда две числа от
// интервала [1..9].
// Програмата да извежда таблицата за умножение.
// Максималната стойност на множителите е определена от 2-те числа.
// Пример: 2 2
// Изход:
// 1*1= 1;
// 1*2= 2;
// 2*1= 2;
// 2*2= 4;

require_once 'readline.php';

do {
	$n = readline('Въведете първото число[1..9]: ', PHP_EOL);
} while ($n < 1 || $n > 9);

do {
	$m = readline('Въведете второто число[1..9]: ', PHP_EOL);
} while ($m < 1 || $m > 9);

for ($i = 1; $i <= $n; $i++) {
	for ($j = 1; $j <= $m; $j++) {
		echo "$i*$j= " . $i*$j . ';', PHP_EOL;
	}
}