<?php

// Задача 16:
// Да се състави програма, чрез която се въвеждат 2 естествени
// числа N, M от интервала [10..5555].
// Програмата, чрез цикъл for, да извежда всички числа от
// интервала, които са кратни на 50 в низходящ ред.
// Пример: 25,249
// Изход: 200,150,100, 50.

require_once 'readline.php';

do {
	$n = readline('Въведете естествено число N[10..5555]: ', PHP_EOL);
} while ($n < 10 || $n > 5555);

do {
	$m = readline('Въведете естествено число M[10..5555]: ', PHP_EOL);
} while ($m < 10 || $m > 5555);

$min = min($n, $m);
$max = max($n, $m);

for ($max; $max > $min; $max--) {
	if ($max % 50 == 0) {
		echo "$max ";
	}
}