<?php

// Задача 17:
// Да се състави програма, която извежда квадрат, чийто страни са
// оформени със знака *, а вътрешността е запълнена със въведен
// знак.
// Входни данни b - дължина на страната число от интервала
// [3..20], c - желан знак.
// Програмата да използва цикъл for.
// Пример: 4 +
// Изход:
// ****
// *++*
// *++*
// ****

require_once 'readline.php';

$length = readline('Дължина на страната на квадрата[3..20]: ', PHP_EOL);
$c = readline('Желан знак за вътрешността: ', PHP_EOL);

for ($i = 0; $i < $length; $i++) {
	echo '*';
}

echo PHP_EOL;

for ($j = 0; $j < $length - 2; $j++) {
	echo '*';
	
	for ($k = 0; $k < $length - 2; $k++) {
	echo $c;
	}
	
	echo '*', PHP_EOL;
}

for ($l = 0; $l < $length; $l++) {
	echo '*';
}