<?php

// Задача 22:
// Да се състави програма, която извежда първите 10 най-малки
// числа, които се делят на 2, 3 или на 5 и които са по-големи от
// въведено естествено число.
// Числата се извеждат, заедно с техния пореден номер.
// Входни данни: число от интервала [1..999]
// Пример: 1
// Изход: 1:2; 2:3, 3:4, 4:5, 5:6, 6:8, 7:9, 8:10, 9:12, 10:14
// Използвайте цикъл while.

require_once 'readline.php';

do {
	$n = readline('Въведете число[1..999]: ', PHP_EOL);
} while ($n < 1 ||  $n > 999);

$counter = 1;
$num = 1;

while ($counter <= 10) {
	if ((($n + $num) % 2 == 0) || (($n + $num) % 3 == 0) || (($n + $num) % 5 == 0)) {
		echo $counter, ':', $n + $num;
		
		if ($counter < 10) {
			echo ', ';
		}
		$counter++;
	}
	$num++;
}