<?php

// Задача 11: Въведете число N, чрез уеб форма и изкарайте като
// резултат следния триъгълник с височина N:
//   *
//  * *
// *   *
//*******
// .................
// Кaто допълнително упражнение – нарисувайте същия
// триъгълник, но незапълнен.

require_once 'readline.php';

$height = readline('Въведете височина на триъгълника: ', PHP_EOL);

for ($i = 0; $i < $height; $i++) {
	
	for ($j = 0; $j < $height - $i -1; $j++) {
		echo ' ';
	}
	
	echo '*';
	
	if ($i + 1 != $height) {
		for ($k = 0; $k < 2 * $i - 1; $k++) {
			echo ' ';
		}
	}
	
	if (($i != 0) && ($i + 1 != $height)) {
		echo '*';
	}
	
	if ($i + 1 == $height) {
		for ($l = 0; $l < 2 * $i; $l++) {
			echo '*';
		}	
	}
	
	echo PHP_EOL;
}
