<?php

// Задача 11: Въведете число N, чрез уеб форма и изкарайте като
// резултат следния триъгълник с височина N:
//   *
//  ***
// *****
// .................
// Кaто допълнително упражнение – нарисувайте същия
// триъгълник, но незапълнен.

require_once 'readline.php';

$height = readline('Въведете височина на триъгълника: ', PHP_EOL);

for ($i = 1; $i <= $height; $i++) {
	for ($j = 0; $j < $height - $i; $j++) {
		echo ' ';
	}
	for ($k = 0; $k < 2 * $i - 1; $k++) {
		echo '*';
	}
	echo PHP_EOL;
}
