<?php

// Задача 3:
// Да се състави програма, чрез която се въвеждат последователно две
// редици от символи без интервали.
// Програмата да извежда съобщение за резултата от сравнението им по
// позиции.
// Пример: хипопотам, хипопотук
// Изход:
// Двата низа са с равна дължина.
// Разлика по позиции:
// 8 а-у
// 9 м-к

require_once 'readline.php';

$str = readline("Въведете два низа разделени с ', ': ");

$array = explode(', ', $str);

if (mb_strlen($array[0]) == mb_strlen($array[1])) {
	echo 'Двата низа са с равна дължина.', PHP_EOL;
} else {
	echo 'Двата низа са с различна дължина.', PHP_EOL;
}

echo 'Разлика по позиции:', PHP_EOL;

for ($i = 0; $i < min(mb_strlen($array[0]), mb_strlen($array[1])); $i++) {
	if ($array[0]{$i} !== $array[1]{$i}){
		echo $i + 1 . ' ' . $array[0]{$i} . '-' . $array[1]{$i}, PHP_EOL;
	}
}



