<?php

// Задача 6:
// Да се състави програма, чрез която се въвежда изречение с отделни
// думи.
// Като резултат на екрана да се извежда същия текст, но всяка отделна
// дума да започва с главна буква, а следващите я букви да са малки.
// Пример: супер яката задача
// Изход: Супер Яката Задача

require_once 'readline.php';

$str = readline('Въведете изречение: ');

$array = explode(' ', $str);

for ($i = 0; $i < count($array); $i++) {
	$array[$i]{0} = mb_strtoupper($array[$i]{0});
	for ($j = 1; $j < mb_strlen($array[$i]); $j++){
		$array[$i]{$j} = mb_strtolower($array[$i]{$j});
	}
}

echo implode(' ', $array);