<?php

// Задача 2:
// Да се състави програма, която изчислява произведение на две
// естествени числа =>2, като се използва само събиране.
// Входни данни: 2 естествени числа.
// Пример: 4, 5
// Изход: 20

require_once 'readline.php';

do {
	$n = readline('Въведете естественo числo n =>2: ');
} while ($n < 2);

do {
	$m = readline('Въведете естественo числo m =>2: ');
} while ($m < 2);

function multi($n, $m) {

	if ($m == 1) {
		return $n;
	}
	
	return $n + multi($n, $m - 1);
}

echo multi($n, $m);