<?php

// Задача 1:
// Имате двумерен масив 6х5 от естествени числа, чийто стойности са
// въведени предварително.
// Да се състави програма, чрез която се извеждат елементите от масива
// с най-малката и най-голямата стойност.
// Пример:
// 48,72,13,14,15
// 21,22,53,24,75
// 31,57,33,34,35
// 41,95,43,44,45
// 59,52,53,54,55
// 61,69,63,64,65
// Изход:
// най-малко 13;
// най-голямо 95

$array = array(
		array(48, 72, 13, 14, 15),
		array(21, 22, 53, 24, 75),
		array(31, 57, 33, 34, 35),
		array(41, 95, 43, 44, 45),
		array(59, 52, 53, 54, 55),
		array(61, 69, 63, 64, 65)
);

$min = $array[0] [0];
$max = $array[0] [0];

for ($i = 0; $i < 6; $i++){
	for ($j = 0; $j < 5; $j++){
		$min = min($min, $array[$i] [$j]);
		$max = max($max, $array[$i] [$j]);
	}
}

echo "най-малко $min;" . PHP_EOL . "най-голямо $max"; 
