<?php

// Задача 17:
// Една редица от естествени числа ще наричаме зигзагообразна нагоре,
// ако за елементите и са изпълняват условията:
// N1 < N2 > N3 < N4 > N5 <..
// Съставете програма, която проверява дали въведени в едномерен
// масив редица от числа изпълняват горните изисквания.
// Пример: 1 3 2 4 3 7
// Изход: изпълнява изискванията за зигзагообразна нагоре редица

require_once 'readline.php';

$array = [];
$result = 'Изпълнява изискванията за зигзагообразна нагоре редица.';

do {
	$input = readline('Въведете елемент ' . count($array) . ' от масива: ' . PHP_EOL);
	if ($input !== '') {
		$array[] = $input;
	}
} while ($input !== '');

for ($i= 0; $i < count($array) - 1; $i++){
	if (($i % 2 == 0) && ($array[$i] > $array[$i + 1]) || (($i % 2 != 0) && ($array[$i] < $array[$i + 1]))) {
		$result = 'Не изпълнява изискванията за зигзагообразна нагоре редица.';
		break;
	}
}

echo $result;