<?php

// Задача 16:
// Да се състави програма, чрез която предварително въведени 10
// реални числа от интервала се обработват по следния начин:
// 1. Извежда съществуващите числа.
// 2. Всички елементи със стойност по-малки от -0.231 се заменят със
// сумата от квадрата на индекса им + числото 41.25, а всички останали
// елементи се заменят с произведението между самия елемент и
// неговият пореден номер
// 3. Да се изведат елементите от началния и новообразувания масив.
// 4. Да се изведат средната стойност на всички елементи от новата
// редица, които са различни от 0.
// Пример: -1.12, -2.43, 3.1, 4.2, 0, 6.4, - 7.5, 8.6, 9.1, -4
// Изход: 42.25, 45.25, 9.3, 16.8, 0, 38.4, 90.25, 68.8, 81.9,141.25

require_once 'readline.php';

$array = [];
$arrayNew = [];

do {
	$array[] = readline('Въведете реално число: ' . PHP_EOL);
} while (count($array) < 10);

echo implode(', ', $array), PHP_EOL;

foreach ($array as $key => $value) {
	if ($value < -0.231) {
		$arrayNew[] = pow($key, 2) + 41.25;
	}
	else {
		$arrayNew[] = $value * ($key + 1);
	}
}

echo implode(', ', $arrayNew), PHP_EOL;

$sum = 0;
$counter = 0;

for ($i = 0; $i < count($arrayNew); $i++) {
	$sum += $arrayNew[$i];
	if ($arrayNew[$i] === 0) {
		$counter++;
	}
}

$average = $sum / (count($arrayNew) - $counter);

echo 'средната стойност на всички елементи от новата редица, които са различни от 0 е: ' . $average; 