<?php

// 		Задача 10:
// Трябва да се напълни цистерна с вода. Имате 2 кофи с вместимост 2 и
// 3 литра и ги ползвате едновременно.
// Да се състави програма, която по даден обем извежда как ще прелеете
// течността с тези кофи, т.е. по-колко пъти ще се пълни всяка от кофите.
// Входни данни: естествено число от интервала [10..9999].
// Пример: 107
// Изход: 21 пъти по 2 литра,
// 21 пъти по 3 литра
// допълнително кофа от 2 литра

require_once 'readline.php';

$a = readline('Естествено число от интервала [10..9999] A:', PHP_EOL);

if ($a < 10 || $a > 9999) {
	echo 'Неправилно въведени данни.';
}
else {
	$n = floor($a / 5);
	
	$o = $a % 5;
	
	if ($o == 0){
		echo "$n пъти по 2 литра", PHP_EOL, "$n пъти по 3 литра";
	}
	if ($o == 1){
		echo $n - 1 . ' пъти по 2 литра', PHP_EOL, $n - 1 . ' пъти по 3 литра', PHP_EOL, 'допълнително 2 кофи от 3 литра';
	}
	if ($o == 2){
		echo "$n пъти по 2 литра", PHP_EOL, "$n пъти по 3 литра", PHP_EOL, "допълнително кофа от 2 литра";
	}
	if ($o == 3){
		echo "$n пъти по 2 литра", PHP_EOL, "$n пъти по 3 литра", PHP_EOL, "допълнително кофа от 3 литра";
	}
	if ($o == 4){
		echo "$n пъти по 2 литра", PHP_EOL, "$n пъти по 3 литра", PHP_EOL, "допълнително 2 кофи от 2 литра";
	}
}

