<?php

// 		Задача 16:
// Въведено е трицифрено естествено число от вида abc.
// Трябва да се провери дали:
// ако a = b = c - Изход: цифрите са равни;
// ако a>b>c - Изход: цифрите са във възходящ ред;
// ако a<b<c цифрите са в низходящ ред;
// и изход: цифрите са ненаредени, за неописаните случаи.
// Да се състави програма, която извежда резултата от проверката за
// наредба на цифрите в числото.
// Пример: 345
// Изход: възходящ ред.

require_once 'readline.php';

$num = readline('Трицифрено естествено число:', PHP_EOL);

if ($num < 100 || $num > 999) {
	echo 'Неправилно въведени данни.';
}
else {
	$c = $num % 10;
	$b = floor($num / 10) % 10;
	$a = floor($num / 100) % 10;
	
	if ($a == $b && $b == $c) {
		echo 'цифрите са равни';
	}
	else if ($a > $b && $b > $c) {
		echo 'цифрите са във възходящ ред';
	}
	else if ($a < $b && $b < $c) {
		echo 'цифрите са в низходящ ред';
	}
	else {
		echo 'цифрите са ненаредени';
	}
}