<?php

// Задача 15:
// Да се състави програма, която въвежда естествено число от интервала
// [0..24].
// Програма да изведе съответстващо съобщение съобразно въведения
// час.
// Периодите са:
// [18..4] - Добър вечер;
// [4..9] - Добро утро;
// [9..18] - Добър ден
// Пример: 10
// Изход: Добър ден

require_once 'readline.php';

$t = readline('Час [0..24]:', PHP_EOL);

if ($t < 0 || $t > 24) {
	echo 'Неправилно въведени данни.';
}
else if ($t < 4 || $t >= 18) {
	echo 'Добър вечер';
}
else if ($t < 9 && $t >= 4) {
	echo 'Добро утро';
}
else if ($t < 18 && $t >= 9) {
	echo 'Добър ден';
}