<?php

// 		Задача 8:
// Да се състави програма, която получава от конзолата 4-цифренo
// естествено число от интервала [1000.. 9999]. От това число се
// формират 2 нови 2-цифрени числа. Първото число се формира от 1-та
// и 4-та цифра на въведеното число. Второто число се формира от 2-рa -
// 3-та цифра на въведеното число. Като резултат да се изведе дали 1-то
// ново число e по-малко <, равно = или по-голямо от 2-то число.
// Пример: 3332 Изход: по-малко (32<33)
// Пример: 1144 Изход: равни (14=14)
// Пример: 9875 Изход: по-голямо (95>87)

require_once 'readline.php';

$a = readline('4-цифренo естествено число от интервала [1000.. 9999]:', PHP_EOL);

if ($a < 1000 || $a > 9999) {
	echo 'Неправилно въведени данни.';
}
else {
	$n4 = $a % 10;
	$n3 = ($a / 10) % 10;
	$n2 = ($a / 100) % 10;
	$n1 = ($a / 1000) % 10;
	
	$a1 = $n1 * 10 + $n4;
	$a2 = $n2 * 10 + $n3;
	
	if ($a1 < $a2){
		echo "по-малко ($a1 < $a2)";
	}
	else if ($a1 == $a2){
		echo "равни ($a1 = $a2)";
	}
	else{
		echo "по-голямо ($a1 > $a2)";
	}
	
}
