<?php

// 		Задача 12:
// Високосни години са всички години кратни на 4 с изключения
// столетията, но без столетия кратни на 400, т.е. 1900 не е високосна,
// но 1600 и 2000 са високосни.
// Съставете програма, която по дадени ден, месец, година отпечатва
// следващата дата.
// Входни данни: три числа за ден, месец, година.
// Пример: 28, 2, 2000
// Изход: 1,3,2000

require_once 'readline.php';

$d = readline('Ден:', PHP_EOL);
$m = readline('Месец:', PHP_EOL);
$y = readline('Година:', PHP_EOL);

if (($d < 30 && $m != 2) || ($d < 28 && $m == 2)) {
	echo ($d + 1).', '.$m.', '.$y;
}
else if (($d == 30 && ($m == 4 || $m == 6 || $m == 8 || $m == 9 || $m == 11)) || ($d == 31 && ($m == 1 || $m == 3 || $m == 5 || $m == 7 || $m == 10)) || ($d == 29 && $m == 2)) {
	echo '1, '.($m + 1).', '.$y;
}
else if ($d == 31 && $m == 12) {
	echo '1, 1, '.($y + 1);
}
else if ($d == 28 && $m == 2) {
	if ((($y % 4 == 0) && ($y % 100 != 0)) || ($y % 400 == 0)) {
		echo ($d + 1).', '.$m.', '.$y;
	}
	else {
		echo '1, '.($m + 1).', '.$y;
	}
}