<?php

// 		Задача 13:
// Да се състави програма, която да отгатне колко е студено/топло по
// въведената температура t в градус Целзий.
// Температурните интервали са:
// под -20 ледено студено;
// между 0 и -20 - студено;
// между 15 и 0 - хладно;
// между 25 и 15 - топло;
// над 25 – горещо.
// Входни данни: цяло число от интервала [-100..100].
// Пример: 12
// Изход: хладно

require_once 'readline.php';

$t = readline('Температура [-100..100]:', PHP_EOL);

if ($t < -100 || $t > 100) {
	echo 'Неправилно въведени данни.';
}
else if ($t < -20) {
	echo 'ледено студено';
}
else if ($t >= -20 &&  $t <0) {
	echo 'студено';
}
else if ($t >= 0 && $t < 15) {
	echo 'хладно';
}
else if ($t >= 15 && $t < 25) {
	echo 'топло';
}
else if ($t >= 25) {
	echo 'горещо';
}