<?php

// 		Задача 9:
// Да се състави програма, която получва от конзола 2 естествени
// двуцифрени числа a,b.
// Програмата да изведе съобщение дали последната цифра от
// произведението на двете числа е четна, както и самата цифра.
// Входни данни: a,b - естествени числа от интервала [10..99].
// Пример: 15, 25
// Изход: 375, 5 нечетна

require_once 'readline.php';

$a = readline('Естествено число от интервала [10..99] A:', PHP_EOL);

$b = readline('Естествено число от интервала [10..99] B:', PHP_EOL);

if (($a < 10 || $a > 99) || ($b < 10 || $b > 99)) {
	echo 'Неправилно въведени данни.';
}
else {
	$c = $a * $b;
	
	echo $c;
	
	$o = $c % 10;
	
	if (($o % 2) == 0){
		echo ", $o четна";
	}
	else{
		echo ", $o нечетна";
	}
}