<?php

// 		Задача 7:
// Въведете 3 променливи от конзолата – час, сума пари, дали съм здрав
// – число със стойност да или не.
// Съставете програма, която взема решения на базата на тези данни по
// следния начин:
// - ако съм болен няма да излизам
// - ако имам пари ще си купя лекарства
// - ако нямам – ще стоя вкъщи и ще пия чай
// - ако съм здрав ще изляза на кино с приятели
// - ако имам по-малко от 10 лв ще отида на кафе
// Покажете резултата като съобщение в уеб страница.

require_once 'readline.php';

$time = readline('Час:', PHP_EOL);

$money = readline('Сума пари:', PHP_EOL);

$health = readline('Здрав (1 за да, 0 за не):', PHP_EOL);

if ($health == 0){
	echo 'Няма да излизам';
	if ($money > 0){
		echo ' и ще си купя лекарства.';
	}
	else {
		echo ', ще си стоя вкъщи и ще пия чай.';
	}
}
else if ($money < 10){
	echo 'Ще отида на кафе.';
}
else{
	echo 'Ще изляза на кино с приятели.';
}