<?php

// Задача 11:
// Съставете програма, която по дадено трицифренo число проверява
// дали числото се дели на всяка своя цифра. Във въведеното число да
// няма цифра 0.

require_once 'readline.php';

$a = readline('Трицифрено естествено число без цифра 0:', PHP_EOL);

$a1 = $a % 10;
$a2 = floor($a / 10) % 10;
$a3 = floor($a / 100) % 10;

if ($a1 == 0 || $a2 == 0|| $a3 == 0 || $a > 999 || $a < 111){
	echo 'Неправилно въведени данни.';
}
else {
	if ($a % $a1 == 0 && $a % $a2 == 0 && $a % $a3 == 0){
		echo 'Числоте се дели на всяка своя цифра.';
	}
	else {
		echo 'Числоте не се дели на всяка своя цифра.';
		
	}
}