<?php

// 		Задача 14:
// Да се състави програма, която по въведени координати на 2 позиции
// от шахматната дъска извежда отговор дали са оцветени в еднакъв или
// различен цвят.
// Шахматната дъска е квадратна.
// Въвеждат се две двойки числа от интервала [1..8].
// Пример: 2 2 3 2
// Изход: Позициите са с различен цвят

require_once 'readline.php';

$x1 = readline('Въведете координатите x1 [1..8]:', PHP_EOL);
$y1 = readline('Въведете координатите y1 [1..8]:', PHP_EOL);
$x2 = readline('Въведете координатите x2 [1..8]:', PHP_EOL);
$y2 = readline('Въведете координатите y2 [1..8]:', PHP_EOL);

if ($x1 > 8 || $y1 > 8 || $x2 > 8 || $y2 > 8 || $x1 < 1 || $y1 < 1 || $x2 < 1 || $y2 < 1 ){
	echo 'Неправилно въведени данни.';
}
else if ((($x1 + $y1) % 2 == 0 && ($x2 + $y2) % 2 == 0) || (($x1 + $y1) % 2 != 0 && ($x2 + $y2) % 2 != 0)) {
	echo 'Позициите са с еднакъв цвят';
}
else {
	echo 'Позициите са с различен цвят';
}